{"data": [{"data": ["Right now what they're doing, have it now.", "We're going to have a big one. You know why? Why not?", "Know it's never enough. Oh, I hadn't.", "I didn't like this.", "I think they are.", "I don't know why they're doing it. Oh, that was great.", "But this time it was.", "Yeah, exactly.", "Exactly right. And I think the only thing that.", "You have to go, right?", "Here's the thing. You have to think about it.", "So I was like, Yeah, I've been rejected and I have to die.", "I was like, What? And you look.", "That. Right here in South America.", "So now I am going.", "Right around another.", "Tuesday, March 19"], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=216bfec6-d246-426b-9ea4-b1380136440e&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=0&isPrimary=false&absoluteTime=13355342701.036", "start_time": 1, "end_time": 135}, {"data": ["We'll be in the dark. All right.", "Welcome. Welcome, everyone. Welcome back. I hope you had a restful and a pleasant spring break.", "Welcome back to your favorite algorithms, class and mine.", "I'm sorry, 330. We are about two thirds of the way through the semester.", "About two thirds of the way through. So we're rolling downhill at this point.", "We're looking toward the end. You all have completed the majority of your work for the semester.", "I hear there's some basketball that's about to happen. There are flowers blooming in the gardens.", "It's a nice time of year unless you're allergic to the pollen. Good luck.", "I'm glad you called back. I'm looking forward to resuming our study together.", "We're going to be starting a new unit this week talking about maximum flow, minimum cut algorithms and applications and matching.", "L 18: Flows and Cuts 1", "Reference and some figure credit:", "Chapter 10, Algorithms by Erickson"], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=216bfec6-d246-426b-9ea4-b1380136440e&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=1&isPrimary=false&absoluteTime=13355342880.536", "start_time": 180, "end_time": 270}, {"data": ["Right. So here's what we'll do today.", "This is a little bit of a story. Computing Max Wasserman is going to be a little bit of a process.", "So what we're going to do today is first introduce these two problems,", "the graph maximum flow problem and the graph minimum cut problem will introduce those.", "And then I'd like to discuss the concept of weak and then strong duality.", "I will discuss this narrowly within the context of maximum flow and minimum cut.", "Today, However, I want you to be aware that actually the concept of weak and strong duality,", "which we will today discuss in the specific case of this problem,", "is a much, much more general phenomenon in a broader class of optimization techniques known as linear programing.", "I will say a bit more about linear programing much later in the course, but today we will look at,", "Outline", "I. Introducing and Defining Graph Flows and Cuts", "2. Weak and Strong Duality: Relating Flows and Cuts", "3. Ford-Fulkerson: Computing Flows and Cuts"], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=cef4368d-022e-48e4-80df-b13801366004&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=303&isPrimary=true&absoluteTime=13355343003.536", "start_time": 303, "end_time": 360}, {"data": ["The origin. As far as I am aware of the intellectual study of the maximum flow and the minimum problems dates back to the early 1950s.", "This is a diagram that Erikson includes in his text that was dug up from military archives.", "I believe it was declassified sometime in the 1990s.", "Though it dates to the early 1950s, it is a map of the rail network of Central and Eastern Europe,", "which was being studied by by the military in an attempt to understand essentially", "what would we have to do to fundamentally disrupt the flow of material between,", "say, East Germany and the Soviet Union. Like, what would we have to hit in terms of the rail network to do that?", "That formulation of a problem corresponds kind of to the minimum cut problem in some sense, where you're looking at a network,", "a network with which has potentially many paths from multiple points of interest and you're interested in questions about bottlenecks,", "could identify certain bottlenecks within this network such that disruption of", "those bottlenecks would disrupt flow across the entire network more generally.", "Alternatively, we might think about this in the from the flow perspective.", "We might think about it in perspective, given that I have some transportation networks and logistics network and I want to move goods from, say,", "one side of this network to the other,", "what would be the best way that I could do that and how much should I be able to expect that I can move from one place to another?", "In other words, this maximal flow minimum cut problem, it's related to problems we've been studying in finding paths,", "Congestion, Flows, Cuts, History"], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=cef4368d-022e-48e4-80df-b13801366004&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=426&isPrimary=true&absoluteTime=13355343126.536", "start_time": 426, "end_time": 540}, {"data": ["and it's possible that you're interested not just in the perspective of a single packet of information,", "but you're interested more broadly in how many packets can or cannot flow through this network.", "You might be particularly interested or concerned about bottlenecks in your network affecting performance.", "So just a couple of examples of why we might be interested from an application perspective in the question of congestion, of flows of cuts.", "These also will turn out to be some of the most basic combinatorial optimization", "primitives that will show up in other kinds of reductions and applications.", "And furthermore, this will be our canonical example of several of the ideas that will show up", "again in the broader context of linear programing for optimization problems.", "Congestion, Flow, Cuts, Today"], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=216bfec6-d246-426b-9ea4-b1380136440e&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=4&isPrimary=false&absoluteTime=13355343420.536", "start_time": 720, "end_time": 771}, {"data": ["in particular in s t flow, I mean the following I give you this capacitated directed graph of flow is a function which", "assigns to every edge some amount the amount of flow that is flowing across this edge.", "You can think about this within a given time interval like in a given day.", "How many train cars move across this edge, for example?", "That would be the amount of flow along that given connection.", "This should be a non-negative number.", "You're not allowed to send negative flow along an edge.", "You must send non-negative zero or positive flow along every edge, and you should satisfy two additional constraints.", "What is an (s,t)-flow?"], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=cef4368d-022e-48e4-80df-b13801366004&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=852&isPrimary=true&absoluteTime=13355343552.536", "start_time": 852, "end_time": 900}, {"data": ["Flow should be conserved. And again, intuitively this is just saying that you're not allowed to drop packets as you're routing them through a network.", "You're not allowed to just abandon a train car at a station, etc.", "Are there questions about these two constraints and the definition of what a flow is in a capacitated graph?", "Yes, that would be. V to this orange.", "So this is. Oh, thank you. Here. Always good to beta tests together.", "What is an (s,t)-flow?", "An (s,t)-flow in a capacitated directed graph G = (V, E, c) is a", "function f: E -9 IR20 that assigns a nonnegative value to every", "edge and satisfies:", "1. Capacity constraints: f (u —9 v) —Y v) for every", "10/20", "2. Flow conservation: Inflow equals outflow, that is,", "for every vertex v e V except for s and t.", "10/20 0/S", "55", "5/10 10/10"], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=216bfec6-d246-426b-9ea4-b1380136440e&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=6&isPrimary=false&absoluteTime=13355343780.536", "start_time": 1080, "end_time": 1119}, {"data": ["What does it mean to have a larger float? Let me define to you the notion of the value of a float.", "Typically or economically, I will define the value of a float to be the net flow out of the source vertex.", "Okay. In other words, I'll use this notion When I write F and I put the two bars around it,", "I'll be talking about the value of the flow, which is just the net flow out of the source vertex.", "Okay. So the flow in a blue that's going out from the source, vertex s minus any flow that happens to be rooted into the source, Vertex s.", "Now, you might think it's weird why we root flow into the source vertex as to which I point you to a home or problem.", "You will see shortly as to whether or not you would want to do that.", "The short answer is probably not. And the algorithms that we will study probably will result in new computing flows that do not root flow into F,", "But for the sake of of the definition, let me just tell you, this is what the value would be and.", "Necessarily by the flow conservation constraints.", "This is going to be equal to the net flow into T, right.", "That's got to go somewhere and t is the only place that flow is allowed to disappear, if you will.", "So you can just as easily, if you like,", "characterize the value of the flow by the total flow into T the target T minus the total flow leaving the target t again,", "you might wonder why would I ever want to root flow out of the target?", "T. And again, your intuition and suspicion would be correct that probably you would not want to.", "But this is for the sake of definition.", "In reality, the algorithms that we will specify will more than likely only be routing flow out of SW and only into T,", "Value of an (s,t)-Flow?"], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=cef4368d-022e-48e4-80df-b13801366004&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=1155&isPrimary=true&absoluteTime=13355343855.536", "start_time": 1155, "end_time": 1260}, {"data": ["For example, we're interested in the question of coming up with a greater value flow, a maximum value flow,", "if we may, subject to these constraints, non negativity, capacity constraints and flow conservation.", "Okay. Let me just point out to you how some of those constraints are being satisfied here so that we're on the same page.", "So from my source, Vertex S, I'm routing ten units of flow up to A and nothing along this edge.", "Okay. So the net outflow from SE is ten, so the value of this flow is ten.", "At a flow will be conserved and I have ten units of flow incoming to a,", "so I must have ten units of flow outgoing from a I happen to be routing all of those down to see all ten of those here.", "I'm using exactly the capacity along this edge.", "I could not put any more flow on this particular edge in this case will say that such an edge is saturated.", "The flow along that edge is equal to its capacity. You can't add any more along that edge as opposed to, say,", "this edge from s to a which is unsaturated because there's still remaining capacity that we could add more flow on this edge.", "Continue. See, so at the node C I have ten units of flow incoming.", "I'm routing ten units of flow out of it to D at D,", "I have ten units of flow incoming and I need to root ten units of flow outbound from D, But note that it is not necessary.", "That flow must come in only along one edge and exit only along one edge.", "In this case, ten units come into D, but I actually split that and brought five of it up to B, whereas I route the other five of it directly to T.", "Okay. Now you might think this is a silly flow and that's fine for you to think.", "Indeed. I'd like to ask the question,", "could you come up with a better flow or a better flow in this case means a flow with greater value that is moving more total goods from S to T,", "And I'll give you just a moment to think about that.", "Now we'll do a show of hands to see how big of a flow you think could be routed in this graph.", "If you think that you can root 30 or more units of flow, raise your hand.", "Example of an (s, t)-flow", "With value 10. Could this be increased?", "0/5", "10/10", "0/10", "10/10", "5/15", "5/10", "5/20"], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=cef4368d-022e-48e4-80df-b13801366004&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=1275&isPrimary=true&absoluteTime=13355343975.536", "start_time": 1275, "end_time": 1440}, {"data": ["Okay. Here's an example that routes 15 units of flow from s2 t of total value.", "15 The exercise that we are doing right now does rather beg the question, doesn't it?", "And this is a fairly general question in algorithms. How would you know when you have an optimal What if you are like a normal human being?", "And I say normal human being, perhaps to contrast from a professional mathematician,", "then probably you do this by kind of staring at the example and tweaking things until you're satisfied.", "You can't think of anything better. Right? But how more systematically do we think about verifying that a particular flow is certainly a maximum flow?", "If I give you a flow, could you tell me for sure how could you figure out whether that flow is a maximum flow?", "One way, of course, would be to design an algorithm and prove that it is correct for calculating maximum flow.", "Ignore what I gave you, calculate a maximum flow and see if you could come up with something better.", "Would be one way to do it. Maybe a little roundabout. Could you come up with just a certificate somehow?", "If someone gave you a flow of a particular value,", "could you somehow look at the graph and say that has to be a maximum flow or not necessarily, How could you do that?", "This is going to take us to our other and related question, the question of an estimate cut, and we're going to think about that.", "The notion of an estimate as a kind of a certificate on the possible values of an estimate flow.", "Let me explain. I give you the same directed capacitated graph that I gave you before.", "They need to find an estimate cut to be a partition of the vertices of the graph with the additional property into two sets.", "S.A. a partition of the vertices into two sets.", "S.A. with the additional property that the source vertex is in one of those, I'll call it Capital S to keep us consistent.", "And the target vertex must be in a different one of these.", "I'll call it Capital T to keep this consistent.", "When I say a partition of a set into two subsets, S.A., I mean that together the Union of S.A. should include all of the vertices.", "Maximum Flow Problem", "Given G = (V, E, c), s, t, compute a maximum value", "(s, t)-flow in G.", "10/20", "5/10", "5/10", "0/15", "10/10", "5/15", "0/10", "10/20", "d", "Of value 15. Begs the question: How can you be sure this", "is optimal?"], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=cef4368d-022e-48e4-80df-b13801366004&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=1473&isPrimary=true&absoluteTime=13355344173.536", "start_time": 1473, "end_time": 1620}, {"data": ["Whereas we talk about the value of an asset flow, we will talk about the capacity of an asset cut.", "What is that capacity? When I define a cut, I'll refer to the cut edges.", "The edges that were cut as all of the edges that cross from the source partition of the vertices to the target partition of the vertices.", "So remember, this is a directed graph. The edges are directed.", "So when I talk about the cut edges, I'll talk specifically about the edges that cross from S to T and highlighted those in red here in the diagram.", "Note that this edge from B to C looks like it's crossing the cut and it is but in the wrong direction.", "Intuitively, the reason we need to keep track of the directionality here is of course, at the end of the day we were interested in flows from SE to T,", "and just intuitively this edge is not going to help you to root your flow from entity, but to be just specific, we just were keeping track of the cut.", "Edges are only those that go from the source partition to the target partition.", "Not necessarily equal to all those that cross in either direction between the two partitions.", "Okay. When we want to get the capacity of the cut, we're going to sum over all of the cut edges of the capacity of those edges.", "Capacity of an (s, t)-cut", "The capacity of an (s, t)-cut is the sum of capacities of", "the cut edges that cross from S to T.", "c(u v)", "u€s, ver", "15", "15", "10"], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=cef4368d-022e-48e4-80df-b13801366004&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=1719&isPrimary=true&absoluteTime=13355344419.536", "start_time": 1719, "end_time": 1800}, {"data": ["The minimum cut problem.", "The minimum cut problem, which is related, I'm claiming to you to the maximum SD flow problem is to compute a minimum capacity to cut in sheet.", "Okay, here was an example. Capacity 15 is this minimum.", "Who knows? Well, think about it for a moment. But let me say algorithmically at the outset here, one of the interesting differences.", "So when you first were introduced to the flow problem, perhaps percolating in the back of your mind was,", "how would I solve this algorithmically if you don't already know there?", "It's kind of interesting because even thinking about how to define a brute force algorithm is not immediately obvious for the flow problem.", "What's the space of solutions? It's any flow assignment that satisfies those constraints.", "How many of those are there? Kind of hard to say.", "How would you enumerate them? Kind of hard to say. Not immediately clear even what a brute force solution would look like.", "Not immediately clear even what a greedy algorithm will look like,", "though I think that will become more clear as we discuss the for full person algorithm.", "You'll see that the natural reading algorithm is actually a simplification of the Ford Focus and algorithm.", "In contrast, for the minimum cut problem, at least a brute force solution seems apparent, right?", "A cut, I told you before, can be specified by just a subset of vertices that includes S, and then T is just the complement of anything left over.", "So you could try all subsets of vertices that include s For each one of those subsets,", "you could calculate the capacity of the cut and then you could take the minimum over all of those.", "Of course, that would have runtime.", "That's exponential in the number of vertices, but at least we have an idea of how to specify a brute force algorithm.", "Could we do something better? Could we do something better?", "And how is the way we will do something better related to the maximum flow problem?", "And by the way, what the heck was I talking about earlier with respect to certificates of maximally?", "You may have noticed that the flow we computed earlier had a value of 50.", "You may also have noticed that this minimum cut on the same example has a capacity of 15.", "Minimum Cut Problem", "Given G (V, E, c), s, t, compute a minimum capacity", "(s, t)-cut in G.", "10", "20", "Of capacity 15. What is the relationship to the max flow?"], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=cef4368d-022e-48e4-80df-b13801366004&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=1821&isPrimary=true&absoluteTime=13355344521.536", "start_time": 1821, "end_time": 1959}, {"data": ["Say that again for any valid flow.", "F for any s t cut.", "The value of the flow will be at most the capacity of the cut.", "Okay. This is weak duality in the context of the maximum flow and minimum cut problem.", "We have a maximization problem defined on a particular kind of input.", "We have a minimization problem defined on the same kind of input.", "I'm claiming to you that the value you can obtain for the maximization problem", "will be at most the value of any valid solution to the minimization problem.", "This is easier to see here in the specific context of maximum and cut than it will be later.", "To talk about it a little more abstractly for linear programing. Why is this the case?", "There's a somewhat more formal discussion of this in.", "ERICKSEN But let me give you the kind of one slide idea of this, which I think is a little more intuitive.", "The value of a flow is the net flow out of. SW That's by definition, right?", "Well, by the flow conservation property, that net outflow from S is not allowed to disappear anywhere except at T,", "so it must be getting to t somehow any of the net flow out of F, which is the value of the flow,", "must somehow be routed to T by the flow conservation constraints.", "T is the only place that flow is allowed to end up act ultimately because s is", "in one partition and T is in the other partition by definition of an SD card,", "and because of the net outflow from s has to somehow get to t, it must cross this cut.", "It must go all of this flow. The value f must go from the set s along one of the cut edges to this set.", "T note that that holds not for this very unique cut,", "but for any cut I could define that had s on one partition in T and the other partition, that statement would be true.", "Finally, by the capacity constraints, at most the capacity of the cut flow can pass across that cut,", "because the capacity of the cut is precisely the total capacity on the edges going from the partition to the t partition.", "This is the sketch of the idea for this concept of weak duality that the value of any flow is at most the capacity of any cut.", "Weak Duality: Cuts Bound Flows", "Claim. For a capacitated graph G = (V, E, c), vertices", "s, t e V, (s, t)-flow f and (s, t)-cut (S, T),", "Ifl s", "Where If I is the flow value and IS, Tl is the cut", "capacity.", "s", "10/20", "5/10", "5/10", "5/15", "0/1", "10/10", "0/10", "10/20", "d"], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=216bfec6-d246-426b-9ea4-b1380136440e&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=11&isPrimary=false&absoluteTime=13355344680.536", "start_time": 1980, "end_time": 2160}, {"data": ["Please turn to your neighbor, Take a few moments free to ask questions and take a stretch if you need to, or we'll come back together in five.", "In-Class Exercise", "duke.is/i/zvum", "Talk with your neighbors,", "Submit on your own.", "Graded for completion,", "not correctness."], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=cef4368d-022e-48e4-80df-b13801366004&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=2322&isPrimary=true&absoluteTime=13355345022.536", "start_time": 2322, "end_time": 2340}, {"data": ["I think.", "Yeah. Yeah. You know, they know.", "I take this every day, but it's not.", "Oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh.", "The next. After.", "I speak to you about your understanding of what I see is what I exercise.", "You know where to go. I don't know. I'm not.", "Good. I would add any time you like.", "Yes, absolutely.", "I mean, I, I next another 30 seconds or so and getting your best guess if you haven't already.", "In-Class Exercise", "duke.is/i/zvum", "Talk with your neighbors,", "Submit on your own.", "Graded for completion,", "not correctness."], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=216bfec6-d246-426b-9ea4-b1380136440e&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=14&isPrimary=false&absoluteTime=13355345220.536", "start_time": 2520, "end_time": 2700}, {"data": ["Maybe I should draw a diagram, I think.", "I. Suppose you have some vertex here, V, I think it's okay.", "I have a couple of colors, so let's say that in. One of the flows.", "F Maybe you were saying flow like this and this works.", "And in another flow, perhaps you assign flow like this. Now, suppose you take the minimum of these.", "You're going to get zero zero, but you're still going around ten out.", "So you may violate the flow conservation constraints if you were to do that.", "If. The second question had a type of which I apologize, and the results are going to look wonky.", "It should have asked if every edge has capacity and one by one errors the bane of us all.", "So let's see what you said would be fun to do then.", "Yeah, that'd be right. Because if the capacities were all zero, the answer would be zero, wouldn't it?", "Wouldn't it? True. It sure would. The slightly more interesting question which groups are going to vote on?", "Because that'll be fun. That I meant to ask, was if all of the capacities were white.", "Every edge had a capacity of one then.", "Who? Here? I'll go through these. Who thinks they would be necessarily of any.", "Who thinks of em. Two things and lesson.", "And then. Correct answer is actually o.", "N. Let's think about this together.", "If if each age had capacity one and the value of the flow is the net outflow of s and there are no duplicate or parallel edges.", "How many edges can be outgoing from S at most in minus one.", "Right. How many? How much flow can you put along those in minus one edges, each with capacity, one and minus one.", "So it would necessarily be less be just over in there. Consider a graph that contains at least one path from S2 to and it has positive capacities.", "(3/19/2024) • swea", "preview Style", "Sync results to Excel ror the web automatically and analyze \"th rmre", "detail and flexibiiW.", "l. Suppose f and f are both valid flows, Which Of the following are also valid flows? Select that", "apply.", "ISO", "has n ihø", "Present"], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=216bfec6-d246-426b-9ea4-b1380136440e&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=16&isPrimary=false&absoluteTime=13355345580.536", "start_time": 2880, "end_time": 3060}, {"data": ["Of course, this is going to be helpful for us to think about because we're interested in computing at the start and we're interested in computing.", "Start, Start will argue at a high level as follows.", "If you ask me any feasible study flow, we're going to consider a couple of cases.", "We're going to define something called a residual graph, which is going to be related to both the input graph and the current flow.", "S That's why I've denoted it. G sub f. Well, think about a couple of cases.", "One is if there exists something we'll call an augmenting path in that residual graph.", "Then I would claim to you f is not a maximum slope. Alternatively, if there is no augmenting path in the residual graph,", "then the vertices I claim to you the vertices reachable from s in the residual graph which no,", "it will not include t because there will not be an augmenting path will comprise a cut with capacity equal to the flow in g the current flow.", "If I can show you that always we can get to three, then we're golden y.", "Because if we get to a point where we have a flow with value equal to the capacity of a cut we can define,", "we have a maximum flow and a corresponding minimum cut.", "That is not this claim. That's simply a corollary of weak duality, right?", "Is just a corollary, weak duality that if I give you a flow with value equal to the capacity of a cut,", "then that flow is maximum and that cut must be minimum, otherwise would be violating weak duality.", "So this will be the outline I need to define some constructions for you.", "Those constructions we'll talk about in the context of arguing this, but they will very much be part of the algorithm as well.", "So it'll be important for us to be careful about how to do this. First defining the residual network.", "Strong Duality: Max Flow = Min Cut", "Stronger Claim. Let f* be a max. (s, t)-flow and let", "(S* , T* ) be a min. (s, t)-cut. Then", "If*l -"], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=216bfec6-d246-426b-9ea4-b1380136440e&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=18&isPrimary=false&absoluteTime=13355345940.536", "start_time": 3240, "end_time": 3363}, {"data": ["So I'm going to play with the edges and the residual graph. In particular, there'll be two types of edges in the residual graph.", "Forward and reverse edges. Let me think about this.", "In the most general case here, where I'm just going to talk with this informally for every partially saturated edge.", "So let's think about the edges that have some flow routing along them, but are not saturated.", "Right? They're not at their capacity.", "So some edge like this for the most general case from UDP, currently assigning a flow of five with a capacity of 20.", "In the original graph, then in the residual graph we would have two edges a forward edge from you to V with the remaining unused capacity.", "Okay. This is our bookkeeping that says hey, we could send at most 15 more flow along the edge.", "You'd have the the remaining capacity on that edge and we will define a reverse edge in the opposite direction.", "So from V to you instead of from you to B, and the capacity of that reverse edge will be equal to the assigned flow in the original graph.", "So five In this case, I will just draw my reverse edges with dashes to help you to visualize the forward versus the reverse edges.", "But I do not mean by that that the reverse edges are not edges in the residual graph.", "They are edges in the residual graph. Just doing this to help us visually.", "Okay, So forward edges, reverse edges will have these two types of edges in our residual network.", "The forward edges correspond to how much remaining capacity do I have on an edge?", "If I wanted to push more flow along it, the reverse edges correspond to how much edge might be,", "how much flow in my already sending across the edge you to V that I could", "potentially change my mind about later and decide not to root along due to the.", "Given a larger example here. So here is one of our earlier examples of a graph with a flow along.", "It removed the notation. I'm showing them the flow, slash the capacity, all of these.", "Let's try to define the residual network first. I'll draw the forward edges.", "The forward edges. Note Ah, for any of these that have remaining capacity, okay.", "And I'll draw those in solid. So for example from S to A, in the original graph we were sending ten units of flow and we had a capacity of 20.", "So we have a remaining capacity of ten, we have ten additional capacity we could use,", "Defining The Residual Network:", "Informal", "Given graph G = (V, E, c) and flow f, the residual", "network G/ = (V, ET, Cf) has two types of edges. For", "every partially saturated edge u -+ v E E..."], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=216bfec6-d246-426b-9ea4-b1380136440e&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=19&isPrimary=false&absoluteTime=13355346120.536", "start_time": 3420, "end_time": 3600}, {"data": ["The residual capacity will be equal to the original capacity minus the flow.", "So it's just the remaining capacity along that edge.", "And for every edge from you to being in your original graph that has a non-zero flow assigned to it,", "you will also have a reverse edge in the opposite direction from V2.", "You in your residual network and the capacity of that edge will be equal to the flow that you were routing from you to the in the original graph.", "Okay. Okay. Got four questions about the definition of the residual network.", "It's more than just the definition. To run this algorithm, you will need to explicitly construct and maintain this network.", "Defining The Residual Network:", "Formal", "Given graph G = (V, E, c) and flow f, the residual", "network G/ = (V, Ef, Cf) has two types of edges:", "• For every u v e E with f (u v) < c(u v):", "• There is a forward edge u —i v e Ef"], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=216bfec6-d246-426b-9ea4-b1380136440e&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=21&isPrimary=false&absoluteTime=13355346480.536", "start_time": 3780, "end_time": 3840}, {"data": ["Here's how to augment the flow. Again,", "Augmenting Flow", "-The residual", "10", "network Gr", "10"], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=cef4368d-022e-48e4-80df-b13801366004&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=3957&isPrimary=true&absoluteTime=13355346657.536", "start_time": 3957, "end_time": 3960}, {"data": ["That's the second case. You know, in this example, actually in the original graph, there is no edge from seed to air.", "There's only an edge for me to see. We're going to reduce its flow by five.", "Then we have another forward edge. We're going to add five to the corresponding edge in the original graph.", "We had another reverse edge. We're going to reduce by five the flow in the reverse of that in the original graph, and we have another forward edge.", "We'll add five there. And let's do a full example of an overall augmentation step like this.", "So I start I have some flow in my original graph.", "I construct the residual network, but I have forward edges and I have reverse edges in my residual network.", "This is the same example as before. I find an augmenting path in that network and I compute its bottleneck capacity,", "the minimum residual capacity along that path in the residual network.", "Then the flow augmentation step happens back in the original network where, for example, for every forward edge, I can add the bottleneck capacity.", "So whereas previously from STC, we had zero flow.", "After augmentation, I will now have five flow because this was a forward edge in the augmenting path in my residual network.", "Alternatively, for a reverse edge such as from C to A in the residual network,", "I'm going to reduce the flow by five in the reverse edge in the original graph.", "The reverse of C to A in the original graph is A to C.", "You'll notice that originally that had ten flow on it. I'm going to reduce that to five.", "If this is necessary, in effect, to satisfy the flow conservation constraints.", "And I continue in this fashion.", "So I'm going to add five on this forward edge, reduce five on this one here that corresponds to the reverse edge from BD and then add five here.", "Overall, if you compare what we started with to our augmented flow, you will see that we have increased the value of this flow by five,", "which is equal to the bottleneck capacity of the augmenting path that we found.", "Our question about this augmentation step further different on the table.", "So.", "So the question is about different choices of augmenting paths, which will be an important question we'll need to talk about for any augmenting path.", "You're going to make progress. Okay. The amount of progress you're going to make is going to be equal to the bottleneck capacity now,", "Augmenting Flow", "Given an augmenting path P in Gr with bottleneck", "capacity b, define the augmented flow (in G):", "if u P", "otherwise", "The residual", "network Gf", "10", "10", "5", "10", "b", "15", "515", "d", "10", "10", "15"], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=216bfec6-d246-426b-9ea4-b1380136440e&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=23&isPrimary=false&absoluteTime=13355346840.536", "start_time": 4140, "end_time": 4320}, {"data": ["A few observations.", "One is that the augmented flow will be the capacity constraints, meaning that the new flow will be non-negative and at most the capacity.", "Why is that? For a forward edge, we add at most the remaining capacity because we add the bottleneck,", "which was the minimum residual capacity across the entire pack.", "For a reverse edge, we subtract at most the forward flow because the residual capacity for reverse edge was equal to the forward flow.", "So when we subtract for reverse edge were never making the flow negative anywhere.", "So both of these essentially just follow from the definitions of the residual capacities and the", "fact that the bottleneck capacity is defined as the minimum residual capacity over the entire path.", "So satisfying the capacity constraints is relatively easy to see.", "I think it takes another minute or so to see that the automated flow will obey the flow conservation constraints,", "but inflows will still equal outflows except at the source and the target.", "But the critical observation is that they are only changed by the bottleneck capacity and they are only change for vertices on the augmenting path.", "Those are the only vertices we need to worry about.", "Their inflows and outflows changing are those on the augmenting path where potentially inflows and outflows", "are just changing by being they might be increasing or decreasing by B because that's all that we do.", "There are four cases then when you think about all combinations of inbound outbound forward edge, reverse edge,", "so you end up with a little table like this that I'll leave you to ponder for a little bit before we come back next time.", "The highlight of it is that in all of these cases, you're still going to be satisfying flow conservation.", "You're not. You might be changing inflows and outflows, but you're necessarily still going to satisfy them in all the possible cases.", "So we'll talk more about how to pull all this together into an algorithm for max loads and how to apply that next time.", "Thank you, everyone. Have a wonderful afternoon. Take care.", "Bye. What's going to happen later?", "Augmented Flow Observations", "Claim I. Augmented flow obeys capacity constraints:", "O f '(u * v) —+ v) for all u —»v e E,"], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=cef4368d-022e-48e4-80df-b13801366004&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=4365&isPrimary=true&absoluteTime=13355347065.536", "start_time": 4365, "end_time": 4500}, {"data": ["There are often going to be multiple ways to solve a problem with them.", "I see. I see. Indeed. I think that the opening scheduling example that we did didn't lecture is, is one of these.", "There are multiple ways that you can sort or really choose things that can result in optimal solutions in that case, but also multiple incorrect ones.", "You just want to confirm a reasonable good for reflection versus assuming it's still on the calendar.", "Yes, I think I assume it is. I know that. Yes.", "New race and faculty goals. Yeah.", "I'm going to ask you, you got a quick question.", "You also had a question on the board, rather, because I'm meeting with them after class for stuff about the exam.", "So go ahead. Yeah. So would you want to walk back with me? Yeah. I don't know if yours is just a qualification or if you're going to accept.", "It's like, I'm sorry, baby doll. Sounds nuts. I don't look at it as, like the old mess.", "You don't like the unions? That is equal to like there is something that covers all of the enemies.", "Yeah. Discretion. So I think I've got something like this.", "I think my intuition is somewhat. The first.", "If you want to consider. So.", "Consider this week's The Light that overlaps with that first interview, and then take the one that has the furthest right in point for it.", "Um, and so I was, I had two questions of one being, what do you like?", "How do I generalize this when there isn't an overlap in the interviews and to also just like the runtime.", "Augmented Flow Observations", "Claim 2. Augmented flow obeys flow conservation:", "in flow fin = out flow fout for all v V — {s, t}.", "Inflow & outflows are only changed by bottleneck", "capacity b for vertices on the augmenting path P.", "For such a v E P, there are four cases (in Gf):", "Forward edge out of v", "rout b", "Reverse edge out of v", "Forward edge into v", "Both increase by b", "No change", "1", "Reverse edge into v", "= fout —b", "NO change", "Both decrease by b"], "image": "https://duke.hosted.panopto.com/Panopto/Pages/Viewer/Thumb.aspx?eventTargetPID=216bfec6-d246-426b-9ea4-b1380136440e&sessionPID=e543c35e-e969-47b1-8517-b0ce014753bd&number=26&isPrimary=false&absoluteTime=13355347380.536", "start_time": 4680, "end_time": 1000000}]}